### №24302 на КЕГЭ

#### Условие

На вход алгоритма подаётся натуральное число $N$. Алгоритм строит по нему новое число $R$ следующим образом.
1. Строится троичная запись числа $N$.
2. Далее эта запись обрабатывается по следующему правилу:
    - если сумма цифр троичной записи числа кратна $9$ то к этой записи справа дописывается $2$;
    - если сумма цифр троичной записи числа не кратна $9$, то к этой записи справа дописывается троичная запись остатка от деления суммы цифр записи на $9$;
3. Результат переводится в десятичную систему и выводится на экран.

Полученная таким образом запись является троичной записью искомого числа $R$. Например, для исходного числа $9 = 100_3$ результатом является число $1001_{3} = 28$. А для исходного числа $161 = 12222_3$ результатом является число $122222_3 = 485$.
Укажите минимальное число $R$, которое может быть результатом работы данного алгоритма, при условии, что $N$ больше $166$.

#### Решение

```python 
def perevod(n, base):
    r = ''
    while n > 0:
        r = str(n % base) + r 
        n = n // base
    return r

massive = []
for n in range(167, 1000):
    n_bin = perevod(n, 3)
    summ = n_bin.count('1') + n_bin.count('2') * 2
    if summ % 9 == 0:
        n_bin = n_bin + "2"
    else:
        n_bin = n_bin + perevod((summ % 9), 3)
    massive.append(int(n_bin, 3))
massive = sorted(massive)
print(massive[0])
```

#### Разбор кода по частям

##### 1. Функция перевода числа в другую систему счисления

```python
def perevod(n, base):
    r = ''
    while n > 0:
        r = str(n % base) + r  # Берём остаток и добавляем слева
        n = n // base          # Делим нацело
    return r
```

**Что она делает?**
- Переводит число `n` в систему счисления с основанием `base`
- Например: `perevod(9, 3)` вернёт строку `"100"` (девять в троичной системе)

##### 2. Основной цикл

```python
massive = []  # Здесь будем хранить все результаты R
for n in range(167, 1000):  # Проверяем числа от 167 до 999
```

Мы перебираем все числа больше $166$ и для каждого вычисляем $R$.

##### 3. Перевод числа в троичную систему

```python
n_bin = perevod(n, 3)
```

Переводим наше число $N$ в троичную систему. Результат — строка типа `"12222"`.

##### 4. Подсчёт суммы цифр

```python
summ = n_bin.count('1') + n_bin.count('2') * 2
```

**Как это работает?**
- `n_bin.count('1')` — считает, сколько единиц в записи
- `n_bin.count('2') * 2` — считает, сколько двоек и умножает на 2 (потому что каждая двойка даёт $+2$ к сумме)
- Нули не считаем, так как они не влияют на сумму

**Пример:** для `"12222"` сумма = $1 \cdot 1 + 4 \cdot 2 = 1 + 8 = 9$

##### 5. Применение правила

```python
# Если сумма кратна 9, добавляем "2"
if summ % 9 == 0:
    n_bin = n_bin + "2"  
# Иначе добавляем остаток в троичной системе
else:
    n_bin = n_bin + perevod((summ % 9), 3) 
```

Здесь мы реализуем правило из условия задачи.

##### 6. Сохранение результата

```python
massive.append(int(n_bin, 3))
```

- `int(n_bin, 3)` — переводит троичную строку обратно в десятичное число
- Добавляем это число в список

##### 7. Поиск минимума

```python
# Сортируем список
massive = sorted(massive)  
# Выводим первый (самый маленький) элемент
print(massive[0])          
```

#### Итог

Программа перебирает все числа от $167$ до $999$, применяет к каждому алгоритм из условия и находит минимальное получившееся число $R$.
