### №63030 на Решу ЕГЭ

#### Условие

В числе $57x692y19_{40}$ $x$ и $y$ обозначают некоторые цифры из алфавита системы счисления с основанием $40$. Определите такие значения $x$ и $y$, при которых приведённое число кратно $39$, а число $yx$ в $40$ системе счисления является полным квадратом. В ответе запишите значение числа $yx$ в $40$ системе счисления в десятичной системе счисления.

#### Решение

```python
def toDec(n, base):
    r = 0
    for i in range(len(n)):
        r += n[::-1][i] * base ** i
    return r 

for x in range(0, 40):
    for y in range(0, 40):
        decN = toDec([5, 7, x, 6, 9, 2, y, 1, 9], 40)
        decM = toDec([y, x], 40)

        if decN % 39 == 0 and (decM ** 0.5) % 1 <= 0 and decM > 0:
            print(decM)
```

#### Разбор функции `toDec(n, base)`

```python
def toDec(n, base):
    r = 0
    for i in range(len(n)):
        r += n[::-1][i] * base ** i
    return r True
```

Эта функция переводит число из системы счисления с основанием `base` в десятичную.

**Как она работает:**
1. `n` — список цифр числа (например, `[5, 7, x, 6, 9, 2, y, 1, 9]`)
2. `n[::-1]` — разворот списка в обратном порядке (нужно для удобства: начинаем с самой правой цифры)
3. На каждом шаге берём цифру, умножаем её на соответствующую степень основания и суммируем

**Пример:** Возьмем число $19_{40} = [1, 9] \Rightarrow [9, 1] \Rightarrow  9 \cdot 40^0 + 1 \cdot 40^1 = 9 + 40 = 49_{10}$

#### Разбор основного цикла

```python
for x in range(0, 40):
    for y in range(0, 40):
```
Перебираем все возможные значения x и y (от $0$ до $39$, так как в $40$-ричной системе ровно $40$ цифр: $0$ – $39$).

#### Строка с преобразованиями

```python
decN = toDec([5, 7, x, 6, 9, 2, y, 1, 9], 40)
decM = toDec([y, x], 40)
```

- **decN** — десятичное значение числа $57x692y19_{40}$
- **decM** — десятичное значение числа $yx_{40}$

## Условие проверки

```python
if decN % 39 == 0 and (decM ** 0.5) % 1 <= 0 and decM > 0:
```

**Три условия:**

1. `decN % 39 == 0` — число `decN` делится нацело на $39$ (остаток от деления равен $0$)

2. `(decM ** 0.5) % 1 <= 0 and decM > 0` — число `decM` является полным квадратом
   - `decM ** 0.5` — корень квадратный из decM
   - `% 1` — остаток от деления на $1$ (выделяет дробную часть)
   - Если число полный квадрат, его корень целый, и остаток от деления на $1$ равен $0$
   - Условие `<= 0` необходимо для учёта погрешностей при вычислении с плавающей точкой
   - `decM > 0` — исключаем ноль

3. `print(decM)` — выводим десятичное значение числа $yx_{40}$

## Итоговая логика

Программа перебирает все пары $(x, y)$, переводит числа в десятичную систему, проверяет оба условия одновременно, и выводит результат — число $yx_{40}$, представленное в десятичной форме.

**Заметочка:** Это классический пример брутфорса — когда мы просто переочередно проверяем все возможные варианты. В данном случае это оправдано, так как перебираем всего $40^2 = 1600$ пар, что вычисляется мгновенно!