### №28938

#### Условие

В файле содержится последовательность целых чисел. Её элементы могут принимать целые значения от $-100\,000$ до $100\,000$ включительно.

Определите количество троек элементов последовательности, в которых **хотя бы один** из трёх элементов является трёхзначным числом, а среднее арифметическое элементов тройки **положительно** и **меньше максимального элемента** последовательности, оканчивающегося на $28$.

В ответе запишите количество найденных троек чисел, затем максимальную из сумм элементов таких троек.

> **Примечание:** под тройкой подразумеваются три идущих подряд элемента последовательности.

#### Решение

```python
with open("17_28938.txt") as file:
    data = [int(i) for i in file.readlines()]

max_elem_28 = max([i for i in data if i % 100 == 28])

count = 0
max_sum_trio = 0

for i in range(len(data) - 2):
    trio = [data[i], data[i + 1], data[i + 2]]

    if not (any(100 <= abs(elem) <= 999 for elem in trio)):
        continue

    avarage = sum(trio) / 3
    if not (avarage > 0 and avarage < max_elem_28):
        continue

    max_sum_trio = max(max_sum_trio, sum(trio))
    count += 1

print(count)
print(max_sum_trio)
```

#### Разбор кода по частям

##### 1. Чтение данных из файла

```python
with open("/Users/stas/Downloads/17_28938.txt") as file:
    data = [int(i) for i in file.readlines()]
```

Считываем все строки файла и преобразуем их в список целых чисел.

##### 2. Поиск максимального элемента, оканчивающегося на 28

```python
max_elem_28 = max([i for i in data if i % 100 == 28])
```

**Как это работает?**
- `i % 100 == 28` — проверяет, что последние две цифры числа равны $28$
- `max(...)` — из всех таких чисел выбирается наибольшее

**Пример:** из чисел $128, 528, 1028$ максимальным будет $1028$.

##### 3. Основной цикл по тройкам

```python
for i in range(len(data) - 2):
    trio = [data[i], data[i + 1], data[i + 2]]
```

Перебираем все тройки из трёх идущих подряд элементов. Цикл идёт до `len(data) - 2`, чтобы не выйти за пределы списка.

##### 4. Проверка трёхзначности

```python
if not (any(100 <= abs(elem) <= 999 for elem in trio)):
    continue
```

**Что здесь происходит?**
- `abs(elem)` — берём модуль, чтобы учесть отрицательные трёхзначные числа (например, $-345$)
- `any(...)` — возвращает `True`, если хотя бы один элемент тройки трёхзначный
- Если ни одного трёхзначного нет — пропускаем тройку через `continue`

##### 5. Проверка среднего арифметического

```python
avarage = sum(trio) / 3
if not (avarage > 0 and avarage < max_elem_28):
    continue
```

Вычисляем среднее арифметическое тройки и проверяем два условия:
- среднее **положительно** (`avarage > 0`)
- среднее **меньше** найденного ранее максимума с окончанием $28$

Если хотя бы одно условие не выполнено — тройка не подходит.

##### 6. Обновление счётчика и максимальной суммы

```python
max_sum_trio = max(max_sum_trio, sum(trio))
count += 1
```

- `count` считает количество подходящих троек
- `max_sum_trio` хранит наибольшую сумму среди всех найденных троек

##### 7. Вывод ответа

```python
print(count)
print(max_sum_trio)
```

Выводим сначала количество троек, затем максимальную сумму.

#### Итог

Программа находит все тройки подряд идущих элементов, удовлетворяющих двум условиям: наличие хотя бы одного трёхзначного числа и положительное среднее, не превышающее максимальный элемент последовательности с окончанием $28$. Для таких троек выводится их количество и максимальная сумма.