### №21697 на КЕГЭ

Миша заполнял таблицу истинности логической функции $$F = \neg(x \to y) \lor (z \equiv w) \lor z$$
Он успел заполнить лишь фрагмент из трёх различных её строк, даже не указав, какому столбцу таблицы соответствует каждая из переменных **w, х, y, z**.

```
| ? | ? | ? | ? | F |
|---|---|---|---|---|
| 0 | 0 |   |   | 0 |
|   |   | 1 |   | 0 |
|   | 1 | 0 |   | 0 |
```

Определите, какому столбцу таблицы соответствует каждая из переменных **w, х, y, z**. В ответе напишите буквы **w**, **х**, **у**, **z** в том порядке, в котором идут соответствующие им столбцы (сначала буква, соответствующая первому столбцу; затем буква, соответствующая второму столбцу, и т.д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.

### Решение

```python
print("x y z w")
for x in (0, 1):
    for y in (0, 1):
        for z in (0, 1):
            for w in (0, 1):
                # Логическая функиця f:
                f = not(x <= y) or (z == w) or z
                if f == 0:
                    print(x, y, z, w)
```

### Как это работает

Переберём все возможные комбинации значений переменных и найдём те, где функция $F = 0$.

**1. Полный перебор**
```python
for x in (0, 1):
    for y in (0, 1):
        for z in (0, 1):
            for w in (0, 1):
```
Эти четыре вложенных цикла переберут все $2^4 = 16$ возможных комбинаций четырёх переменных.

**2. Вычисление функции**
```python
f = not(x <= y) or (z == w) or z
```
Для каждой комбинации мы вычисляем значение F по заданной формуле. Здесь $x <= y$ — импликация.

**3. Фильтрация нужных строк**
```python
if f == 0:
    print(x, y, z, w)
```
Мы выводим только те комбинации, где $F = 0$, потому что в таблице Миши все три строки дают $F = 0$.

После запуска программа выведет все строки, где $F = 0$, и останется только сравнить их с тремя строками из таблицы Миши, чтобы понять порядок переменных.