### №21697 на КЕГЭ

Миша заполнял таблицу истинности логической функции $F = \neg(x \to y) \lor (z \equiv w) \lor z$, но успел заполнить лишь фрагмент из трёх различных её строк, даже не указав, какому столбцу таблицы соответствует каждая из переменных **w, х, y, z**.

```
| ? | ? | ? | ? | F |
|---|---|---|---|---|
| 0 | 0 |   |   | 0 |
|   |   | 1 |   | 0 |
|   | 1 | 0 |   | 0 |
```

Определите, какому столбцу таблицы соответствует каждая из переменных **w, х, y, z**. В ответе напишите буквы **w**, **х**, **у**, **z** в том порядке, в котором идут соответствующие им столбцы (сначала буква, соответствующая первому столбцу; затем буква, соответствующая второму столбцу, и т.д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.

#### Решение

```python
print("x y z w")
for x in (0, 1):
    for y in (0, 1):
        for z in (0, 1):
            for w in (0, 1):
                # Логическая функиця f:
                f = not(x <= y) or (z == w) or z
                if f == 0:
                    print(x, y, z, w)
```
