### №21719 на КЕГЭ

#### Условие

В банке дистанционной проверяющей системы имеется более $100 000$ заданий. Все задачи пронумерованы начиная с единицы. Эти задания в течение учебного периода решают участники различных курсов. Каждому студенту при регистрации присваивается уникальный идентификатор — натуральное число, не превышающее $1 000 000$.  Студент может сдать несколько различных правильных решений одной задачи, при этом в зачёт идёт только одно из них.
Преподаватель сделал выгрузку результатов за некоторый период времени и выбрал студента, который решил наибольшее количество задач из банка через одну (одну решил, следующую нет и т.д.).

Определите идентификационный номер студента, который решил наибольшее количество задач через одну, и количество решённых им задач. Если несколько студентов решили одинаковое максимальное количество задач, то укажите студента с наименьшим идентификационным номером.

**Входные данные**
В первой строке входного файла находится число $N$ - количество зачтённых решений (натуральное число, не превышающее $60 000$) за некоторый период времени. Каждая из следующих $N$ строк содержит два натуральных числа, не превышающих $1 000 000$: идентификатор студента и номер правильно решённой задачи.

**Выходные данные**
Два целых неотрицательных числа: наименьший идентификационный номер студента и наибольшее количество успешно решённых задач через одну.

#### Решение
```python
with open("26_21719.txt", "r") as file:
    data = [list(map(int, i.split(' '))) for i in file.readlines()][1:]

def find_longest_sequence(tasks):
    max_count = 0

    count = 0
    for i in range(1, len(tasks)):
        if tasks[i - 1] + 2 == tasks[i]:
            count += 1
        else:
            count += 1 
            if count > max_count:
                max_count = count
            count = 0
    return max_count

table = {}
for line in data:
    student, task = line 

    if student not in table:
        table[student] = set()
    table[student].add(task)

max_count = float('-inf')
max_id    = float('inf')
for student, tasks in sorted(table.items()):
    tasks = sorted(tasks)
    tasks = find_longest_sequence(tasks)

    if tasks > max_count:
        max_count = tasks
        max_id = student

    if tasks == max_count and student < max_id:
        max_id = student

print(max_id, max_count)
```